OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f072cx6.h
/*!< ADC_JDR2 */
#define ADC_JDR2_JDR2_Pos                         (0U)
#define ADC_JDR2_JDR2_Msk                         (0xFFFFUL << ADC_JDR2_JDR2_Pos)                   /*!< 0x0000FFFF */
#define ADC_JDR2_JDR2                             ADC_JDR2_JDR2_Msk                                 /*!< JDR2[15:0] bits (desc JDR2) */

/*!< ADC_JDR3 */
#define ADC_JDR3_JDR3_Pos                         (0U)
#define ADC_JDR3_JDR3_Msk                         (0xFFFFUL << ADC_JDR3_JDR3_Pos)                   /*!< 0x0000FFFF */
#define ADC_JDR3_JDR3                             ADC_JDR3_JDR3_Msk                                 /*!< JDR3[15:0] bits (desc JDR3) */

/*!< ADC_JDR4 */
#define ADC_JDR4_JDR4_Pos                         (0U)
#define ADC_JDR4_JDR4_Msk                         (0xFFFFUL << ADC_JDR4_JDR4_Pos)                   /*!< 0x0000FFFF */
#define ADC_JDR4_JDR4                             ADC_JDR4_JDR4_Msk

/*!< ADC_DR */
#define ADC_DR_DATA_Pos                           (0U)
#define ADC_DR_DATA_Msk                           (0xFFFFUL << ADC_DR_DATA_Pos)                     /*!< 0x0000FFFF */
#define ADC_DR_DATA                               ADC_DR_DATA_Msk

/*!< ADC_CCSR */
#define ADC_CCSR_CALSEL_Pos                       (11U)
#define ADC_CCSR_CALSEL_Msk                       (0x1UL << ADC_CCSR_CALSEL_Pos)                    /*!< 0x00000800 */
#define ADC_CCSR_CALSEL                           ADC_CCSR_CALSEL_Msk                               /*!< desc CALSEL */
#define ADC_CCSR_CALSMP_Pos                       (12U)
#define ADC_CCSR_CALSMP_Msk                       (0x3UL << ADC_CCSR_CALSMP_Pos)                    /*!< 0x00003000 */
#define ADC_CCSR_CALSMP                           ADC_CCSR_CALSMP_Msk                               /*!< CALSMP[13:12] bits (desc CALSMP) */
#define ADC_CCSR_CALSMP_0                         (0x1UL << ADC_CCSR_CALSMP_Pos)                    /*!< 0x00001000 */
#define ADC_CCSR_CALSMP_1                         (0x2UL << ADC_CCSR_CALSMP_Pos)                    /*!< 0x00002000 */
#define ADC_CCSR_CALBYP_Pos                       (14U)
#define ADC_CCSR_CALBYP_Msk                       (0x1UL << ADC_CCSR_CALBYP_Pos)                    /*!< 0x00004000 */
#define ADC_CCSR_CALBYP                           ADC_CCSR_CALBYP_Msk                               /*!< desc CALBYP */
#define ADC_CCSR_CALSET_Pos                       (15U)
#define ADC_CCSR_CALSET_Msk                       (0x1UL << ADC_CCSR_CALSET_Pos)                    /*!< 0x00008000 */
#define ADC_CCSR_CALSET                           ADC_CCSR_CALSET_Msk                               /*!< desc CALSET */
#define ADC_CCSR_OFFSUC_Pos                       (29U)
#define ADC_CCSR_OFFSUC_Msk                       (0x1UL << ADC_CCSR_OFFSUC_Pos)                    /*!< 0x20000000 */
#define ADC_CCSR_OFFSUC                           ADC_CCSR_OFFSUC_Msk                               /*!< desc OFFSUC */
#define ADC_CCSR_CAPSUC_Pos                       (30U)
#define ADC_CCSR_CAPSUC_Msk                       (0x1UL << ADC_CCSR_CAPSUC_Pos)                    /*!< 0x40000000 */
#define ADC_CCSR_CAPSUC                           ADC_CCSR_CAPSUC_Msk                               /*!< desc CAPSUC */
#define ADC_CCSR_CALON_Pos                        (31U)
#define ADC_CCSR_CALON_Msk                        (0x1UL << ADC_CCSR_CALON_Pos)                     /*!< 0x80000000 */
#define ADC_CCSR_CALON                            ADC_CCSR_CALON_Msk

/****************************************************************************/
/*                                                                          */
/*                     Controller Area Network(CAN)                         */
/*                                                                          */
/****************************************************************************/
/*********************  Bits Define For Peripheral CAN  *********************/
/*!< CAN_TSNCR */
#define CAN_TSNCR_VERSION_Pos                   (0U)
#define CAN_TSNCR_VERSION_Msk                   (0xFFFFUL << CAN_TSNCR_VERSION_Pos)             /*!< 0x0000FFFF */
#define CAN_TSNCR_VERSION                       CAN_TSNCR_VERSION_Msk                           /*!< VERSION[15:0] bits (desc VERSION) */
#define CAN_TSNCR_CES_Pos                       (16U)
#define CAN_TSNCR_CES_Msk                       (0x1UL << CAN_TSNCR_CES_Pos)                    /*!< 0x00010000 */
#define CAN_TSNCR_CES                           CAN_TSNCR_CES_Msk                               /*!< desc CES */
#define CAN_TSNCR_ROP_Pos                       (17U)
#define CAN_TSNCR_ROP_Msk                       (0x1UL << CAN_TSNCR_ROP_Pos)                    /*!< 0x00020000 */
#define CAN_TSNCR_ROP                           CAN_TSNCR_ROP_Msk                               /*!< desc ROP */

/*!< CAN_ACBTR */
#define CAN_ACBTR_AC_SEG_1_Pos                  (0U)
#define CAN_ACBTR_AC_SEG_1_Msk                  (0x1FFUL << CAN_ACBTR_AC_SEG_1_Pos)             /*!< 0x000001FF */
#define CAN_ACBTR_AC_SEG_1                      CAN_ACBTR_AC_SEG_1_Msk                          /*!< AC_SEG_1[8:0] bits (desc AC_SEG_1) */
#define CAN_ACBTR_AC_SEG_2_Pos                  (16U)
#define CAN_ACBTR_AC_SEG_2_Msk                  (0x7FUL << CAN_ACBTR_AC_SEG_2_Pos)              /*!< 0x007F0000 */
#define CAN_ACBTR_AC_SEG_2                      CAN_ACBTR_AC_SEG_2_Msk                          /*!< AC_SEG_2[22:16] bits (desc AC_SEG_2) */
#define CAN_ACBTR_AC_SEG_2_0                    (0x1UL << CAN_ACBTR_AC_SEG_2_Pos)               /*!< 0x00010000 */
#define CAN_ACBTR_AC_SEG_2_1                    (0x2UL << CAN_ACBTR_AC_SEG_2_Pos)               /*!< 0x00020000 */
#define CAN_ACBTR_AC_SEG_2_2                    (0x4UL << CAN_ACBTR_AC_SEG_2_Pos)               /*!< 0x00040000 */
#define CAN_ACBTR_AC_SEG_2_3                    (0x8UL << CAN_ACBTR_AC_SEG_2_Pos)               /*!< 0x00080000 */
#define CAN_ACBTR_AC_SEG_2_4                    (0x10UL << CAN_ACBTR_AC_SEG_2_Pos)              /*!< 0x00100000 */
#define CAN_ACBTR_AC_SEG_2_5                    (0x20UL << CAN_ACBTR_AC_SEG_2_Pos)              /*!< 0x00200000 */
#define CAN_ACBTR_AC_SEG_2_6                    (0x40UL << CAN_ACBTR_AC_SEG_2_Pos)              /*!< 0x00400000 */
#define CAN_ACBTR_AC_SJW_Pos                    (24U)
#define CAN_ACBTR_AC_SJW_Msk                    (0x7FUL << CAN_ACBTR_AC_SJW_Pos)                /*!< 0x7F000000 */
#define CAN_ACBTR_AC_SJW                        CAN_ACBTR_AC_SJW_Msk                            /*!< AC_SJW[30:24] bits (desc AC_SJW) */
#define CAN_ACBTR_AC_SJW_0                      (0x1UL << CAN_ACBTR_AC_SJW_Pos)                 /*!< 0x01000000 */
#define CAN_ACBTR_AC_SJW_1                      (0x2UL << CAN_ACBTR_AC_SJW_Pos)                 /*!< 0x02000000 */
#define CAN_ACBTR_AC_SJW_2                      (0x4UL << CAN_ACBTR_AC_SJW_Pos)                 /*!< 0x04000000 */
#define CAN_ACBTR_AC_SJW_3                      (0x8UL << CAN_ACBTR_AC_SJW_Pos)                 /*!< 0x08000000 */
#define CAN_ACBTR_AC_SJW_4                      (0x10UL << CAN_ACBTR_AC_SJW_Pos)                /*!< 0x10000000 */
#define CAN_ACBTR_AC_SJW_5                      (0x20UL << CAN_ACBTR_AC_SJW_Pos)                /*!< 0x20000000 */
#define CAN_ACBTR_AC_SJW_6                      (0x40UL << CAN_ACBTR_AC_SJW_Pos)                /*!< 0x40000000 */

/*!< CAN_RLSSP */
#define CAN_RLSSP_PRESC_Pos                     (0U)
#define CAN_RLSSP_PRESC_Msk                     (0x1FUL << CAN_RLSSP_PRESC_Pos)                 /*!< 0x0000001F */
#define CAN_RLSSP_PRESC                         CAN_RLSSP_PRESC_Msk                             /*!< PRESC[4:0] bits (desc PRESC) */
#define CAN_RLSSP_PRESC_0                       (0x1UL << CAN_RLSSP_PRESC_Pos)                  /*!< 0x00000001 */
#define CAN_RLSSP_PRESC_1                       (0x2UL << CAN_RLSSP_PRESC_Pos)                  /*!< 0x00000002 */
#define CAN_RLSSP_PRESC_2                       (0x4UL << CAN_RLSSP_PRESC_Pos)                  /*!< 0x00000004 */
#define CAN_RLSSP_PRESC_3                       (0x8UL << CAN_RLSSP_PRESC_Pos)                  /*!< 0x00000008 */
#define CAN_RLSSP_PRESC_4                       (0x10UL << CAN_RLSSP_PRESC_Pos)                 /*!< 0x00000010 */
#define CAN_RLSSP_REALIM_Pos                    (24U)
#define CAN_RLSSP_REALIM_Msk                    (0x7UL << CAN_RLSSP_REALIM_Pos)                 /*!< 0x07000000 */
#define CAN_RLSSP_REALIM                        CAN_RLSSP_REALIM_Msk                            /*!< REALIM[26:24] bits (desc REALIM) */
#define CAN_RLSSP_REALIM_0                      (0x1UL << CAN_RLSSP_REALIM_Pos)                 /*!< 0x01000000 */
#define CAN_RLSSP_REALIM_1                      (0x2UL << CAN_RLSSP_REALIM_Pos)                 /*!< 0x02000000 */
#define CAN_RLSSP_REALIM_2                      (0x4UL << CAN_RLSSP_REALIM_Pos)                 /*!< 0x04000000 */
#define CAN_RLSSP_RETLIM_Pos                    (28U)
#define CAN_RLSSP_RETLIM_Msk                    (0x7UL << CAN_RLSSP_RETLIM_Pos)                 /*!< 0x70000000 */
#define CAN_RLSSP_RETLIM                        CAN_RLSSP_RETLIM_Msk                            /*!< RETLIM[30:28] bits (desc RETLIM) */
#define CAN_RLSSP_RETLIM_0                      (0x1UL << CAN_RLSSP_RETLIM_Pos)                 /*!< 0x10000000 */
#define CAN_RLSSP_RETLIM_1                      (0x2UL << CAN_RLSSP_RETLIM_Pos)                 /*!< 0x20000000 */
#define CAN_RLSSP_RETLIM_2                      (0x4UL << CAN_RLSSP_RETLIM_Pos)                 /*!< 0x40000000 */

/*!< CAN_IFR */
#define CAN_IFR_AIF_Pos                         (0U)
#define CAN_IFR_AIF_Msk                         (0x1UL << CAN_IFR_AIF_Pos)                      /*!< 0x00000001 */
#define CAN_IFR_AIF                             CAN_IFR_AIF_Msk                                 /*!< desc AIF */
#define CAN_IFR_EIF_Pos                         (1U)
#define CAN_IFR_EIF_Msk                         (0x1UL << CAN_IFR_EIF_Pos)                      /*!< 0x00000002 */
#define CAN_IFR_EIF                             CAN_IFR_EIF_Msk                                 /*!< desc EIF */
#define CAN_IFR_TSIF_Pos                        (2U)
#define CAN_IFR_TSIF_Msk                        (0x1UL << CAN_IFR_TSIF_Pos)                     /*!< 0x00000004 */
#define CAN_IFR_TSIF                            CAN_IFR_TSIF_Msk                                /*!< desc TSIF */
#define CAN_IFR_TPIF_Pos                        (3U)
#define CAN_IFR_TPIF_Msk                        (0x1UL << CAN_IFR_TPIF_Pos)                     /*!< 0x00000008 */
#define CAN_IFR_TPIF                            CAN_IFR_TPIF_Msk                                /*!< desc TPIF */
#define CAN_IFR_RAFIF_Pos                       (4U)
#define CAN_IFR_RAFIF_Msk                       (0x1UL << CAN_IFR_RAFIF_Pos)                    /*!< 0x00000010 */
#define CAN_IFR_RAFIF                           CAN_IFR_RAFIF_Msk                               /*!< desc RAFIF */
#define CAN_IFR_RFIF_Pos                        (5U)
#define CAN_IFR_RFIF_Msk                        (0x1UL << CAN_IFR_RFIF_Pos)                     /*!< 0x00000020 */
#define CAN_IFR_RFIF                            CAN_IFR_RFIF_Msk                                /*!< desc RFIF */
#define CAN_IFR_ROIF_Pos                        (6U)
#define CAN_IFR_ROIF_Msk                        (0x1UL << CAN_IFR_ROIF_Pos)                     /*!< 0x00000040 */
#define CAN_IFR_ROIF                            CAN_IFR_ROIF_Msk                                /*!< desc ROIF */
#define CAN_IFR_RIF_Pos                         (7U)
#define CAN_IFR_RIF_Msk                         (0x1UL << CAN_IFR_RIF_Pos)                      /*!< 0x00000080 */
#define CAN_IFR_RIF                             CAN_IFR_RIF_Msk                                 /*!< desc RIF */
#define CAN_IFR_BEIF_Pos                        (8U)
#define CAN_IFR_BEIF_Msk                        (0x1UL << CAN_IFR_BEIF_Pos)                     /*!< 0x00000100 */
#define CAN_IFR_BEIF                            CAN_IFR_BEIF_Msk                                /*!< desc BEIF */
#define CAN_IFR_ALIF_Pos                        (9U)
#define CAN_IFR_ALIF_Msk                        (0x1UL << CAN_IFR_ALIF_Pos)                     /*!< 0x00000200 */
#define CAN_IFR_ALIF                            CAN_IFR_ALIF_Msk                                /*!< desc ALIF */
#define CAN_IFR_EPIF_Pos                        (10U)
#define CAN_IFR_EPIF_Msk                        (0x1UL << CAN_IFR_EPIF_Pos)                     /*!< 0x00000400 */
#define CAN_IFR_EPIF                            CAN_IFR_EPIF_Msk                                /*!< desc EPIF */
#define CAN_IFR_TTIF_Pos                        (11U)
#define CAN_IFR_TTIF_Msk                        (0x1UL << CAN_IFR_TTIF_Pos)                     /*!< 0x00000800 */
#define CAN_IFR_TTIF                            CAN_IFR_TTIF_Msk                                /*!< desc TTIF */
#define CAN_IFR_TEIF_Pos                        (12U)
#define CAN_IFR_TEIF_Msk                        (0x1UL << CAN_IFR_TEIF_Pos)                     /*!< 0x00001000 */
#define CAN_IFR_TEIF                            CAN_IFR_TEIF_Msk                                /*!< desc TEIF */
#define CAN_IFR_WTIF_Pos                        (13U)
#define CAN_IFR_WTIF_Msk                        (0x1UL << CAN_IFR_WTIF_Pos)                     /*!< 0x00002000 */
#define CAN_IFR_WTIF                            CAN_IFR_WTIF_Msk                                /*!< desc WTIF */
#define CAN_IFR_EPASS_Pos                       (30U)
#define CAN_IFR_EPASS_Msk                       (0x1UL << CAN_IFR_EPASS_Pos)                    /*!< 0x40000000 */
#define CAN_IFR_EPASS                           CAN_IFR_EPASS_Msk                               /*!< desc EPASS */
#define CAN_IFR_EWARN_Pos                       (31U)
#define CAN_IFR_EWARN_Msk                       (0x1UL << CAN_IFR_EWARN_Pos)                    /*!< 0x80000000 */
#define CAN_IFR_EWARN                           CAN_IFR_EWARN_Msk                               /*!< desc EWARN */

/*!< CAN_IER */
#define CAN_IER_EIE_Pos                         (1U)
#define CAN_IER_EIE_Msk                         (0x1UL << CAN_IER_EIE_Pos)                      /*!< 0x00000002 */
#define CAN_IER_EIE                             CAN_IER_EIE_Msk                                 /*!< desc EIE */
#define CAN_IER_TSIE_Pos                        (2U)
#define CAN_IER_TSIE_Msk                        (0x1UL << CAN_IER_TSIE_Pos)                     /*!< 0x00000004 */
#define CAN_IER_TSIE                            CAN_IER_TSIE_Msk                                /*!< desc TSIE */
#define CAN_IER_TPIE_Pos                        (3U)
#define CAN_IER_TPIE_Msk                        (0x1UL << CAN_IER_TPIE_Pos)                     /*!< 0x00000008 */
#define CAN_IER_TPIE                            CAN_IER_TPIE_Msk                                /*!< desc TPIE */
#define CAN_IER_RAFIE_Pos                       (4U)
#define CAN_IER_RAFIE_Msk                       (0x1UL << CAN_IER_RAFIE_Pos)                    /*!< 0x00000010 */
#define CAN_IER_RAFIE                           CAN_IER_RAFIE_Msk                               /*!< desc RAFIE */
#define CAN_IER_RFIE_Pos                        (5U)
#define CAN_IER_RFIE_Msk                        (0x1UL << CAN_IER_RFIE_Pos)                     /*!< 0x00000020 */
#define CAN_IER_RFIE                            CAN_IER_RFIE_Msk                                /*!< desc RFIE */
#define CAN_IER_ROIE_Pos                        (6U)
#define CAN_IER_ROIE_Msk                        (0x1UL << CAN_IER_ROIE_Pos)                     /*!< 0x00000040 */
#define CAN_IER_ROIE                            CAN_IER_ROIE_Msk                                /*!< desc ROIE */
#define CAN_IER_RIE_Pos                         (7U)
#define CAN_IER_RIE_Msk                         (0x1UL << CAN_IER_RIE_Pos)                      /*!< 0x00000080 */
#define CAN_IER_RIE                             CAN_IER_RIE_Msk                                 /*!< desc RIE */
#define CAN_IER_BEIE_Pos                        (8U)
#define CAN_IER_BEIE_Msk                        (0x1UL << CAN_IER_BEIE_Pos)                     /*!< 0x00000100 */
#define CAN_IER_BEIE                            CAN_IER_BEIE_Msk                                /*!< desc BEIE */
#define CAN_IER_ALIE_Pos                        (9U)
#define CAN_IER_ALIE_Msk                        (0x1UL << CAN_IER_ALIE_Pos)                     /*!< 0x00000200 */
#define CAN_IER_ALIE                            CAN_IER_ALIE_Msk                                /*!< desc ALIE */
#define CAN_IER_EPIE_Pos                        (10U)
#define CAN_IER_EPIE_Msk                        (0x1UL << CAN_IER_EPIE_Pos)                     /*!< 0x00000400 */
#define CAN_IER_EPIE                            CAN_IER_EPIE_Msk                                /*!< desc EPIE */
#define CAN_IER_TTIE_Pos                        (11U)
#define CAN_IER_TTIE_Msk                        (0x1UL << CAN_IER_TTIE_Pos)                     /*!< 0x00000800 */
#define CAN_IER_TTIE                            CAN_IER_TTIE_Msk                                /*!< desc TTIE */
#define CAN_IER_WTIE_Pos                        (13U)
#define CAN_IER_WTIE_Msk                        (0x1UL << CAN_IER_WTIE_Pos)                     /*!< 0x00002000 */
#define CAN_IER_WTIE                            CAN_IER_WTIE_Msk                                /*!< desc WTIE */

/*!< CAN_TSR */
#define CAN_TSR_HANDLE_L_Pos                    (0U)
#define CAN_TSR_HANDLE_L_Msk                    (0xFFUL << CAN_TSR_HANDLE_L_Pos)                /*!< 0x000000FF */
#define CAN_TSR_HANDLE_L                        CAN_TSR_HANDLE_L_Msk                            /*!< HANDLE_L[7:0] bits (desc HANDLE_L) */
#define CAN_TSR_TSTAT_L_Pos                     (8U)
#define CAN_TSR_TSTAT_L_Msk                     (0x7UL << CAN_TSR_TSTAT_L_Pos)                  /*!< 0x00000700 */
#define CAN_TSR_TSTAT_L                         CAN_TSR_TSTAT_L_Msk                             /*!< TSTAT_L[10:8] bits (desc TSTAT_L) */
#define CAN_TSR_TSTAT_L_0                       (0x1UL << CAN_TSR_TSTAT_L_Pos)                  /*!< 0x00000100 */
#define CAN_TSR_TSTAT_L_1                       (0x2UL << CAN_TSR_TSTAT_L_Pos)                  /*!< 0x00000200 */
#define CAN_TSR_TSTAT_L_2                       (0x4UL << CAN_TSR_TSTAT_L_Pos)                  /*!< 0x00000400 */
#define CAN_TSR_HANDLE_H_Pos                    (16U)
#define CAN_TSR_HANDLE_H_Msk                    (0xFFUL << CAN_TSR_HANDLE_H_Pos)                /*!< 0x00FF0000 */
#define CAN_TSR_HANDLE_H                        CAN_TSR_HANDLE_H_Msk                            /*!< HANDLE_H[23:16] bits (desc HANDLE_H) */
#define CAN_TSR_TSTAT_H_Pos                     (24U)
#define CAN_TSR_TSTAT_H_Msk                     (0x7UL << CAN_TSR_TSTAT_H_Pos)                  /*!< 0x07000000 */
#define CAN_TSR_TSTAT_H                         CAN_TSR_TSTAT_H_Msk                             /*!< TSTAT_H[26:24] bits (desc TSTAT_H) */
#define CAN_TSR_TSTAT_H_0                       (0x1UL << CAN_TSR_TSTAT_H_Pos)                  /*!< 0x01000000 */
#define CAN_TSR_TSTAT_H_1                       (0x2UL << CAN_TSR_TSTAT_H_Pos)                  /*!< 0x02000000 */
#define CAN_TSR_TSTAT_H_2                       (0x4UL << CAN_TSR_TSTAT_H_Pos)                  /*!< 0x04000000 */

