OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f072cx6.h
/*!< CAN_MCR */
#define CAN_MCR_BUSOFF_Pos                      (0U)
#define CAN_MCR_BUSOFF_Msk                      (0x1UL << CAN_MCR_BUSOFF_Pos)                   /*!< 0x00000001 */
#define CAN_MCR_BUSOFF                          CAN_MCR_BUSOFF_Msk                              /*!< desc BUSOFF */
#define CAN_MCR_LBMI_Pos                        (5U)
#define CAN_MCR_LBMI_Msk                        (0x1UL << CAN_MCR_LBMI_Pos)                     /*!< 0x00000020 */
#define CAN_MCR_LBMI                            CAN_MCR_LBMI_Msk                                /*!< desc LBMI */
#define CAN_MCR_LBME_Pos                        (6U)
#define CAN_MCR_LBME_Msk                        (0x1UL << CAN_MCR_LBME_Pos)                     /*!< 0x00000040 */
#define CAN_MCR_LBME                            CAN_MCR_LBME_Msk                                /*!< desc LBME */
#define CAN_MCR_RESET_Pos                       (7U)
#define CAN_MCR_RESET_Msk                       (0x1UL << CAN_MCR_RESET_Pos)                    /*!< 0x00000080 */
#define CAN_MCR_RESET                           CAN_MCR_RESET_Msk                               /*!< desc RESET */
#define CAN_MCR_TSA_Pos                         (8U)
#define CAN_MCR_TSA_Msk                         (0x1UL << CAN_MCR_TSA_Pos)                      /*!< 0x00000100 */
#define CAN_MCR_TSA                             CAN_MCR_TSA_Msk                                 /*!< desc TSA */
#define CAN_MCR_TSALL_Pos                       (9U)
#define CAN_MCR_TSALL_Msk                       (0x1UL << CAN_MCR_TSALL_Pos)                    /*!< 0x00000200 */
#define CAN_MCR_TSALL                           CAN_MCR_TSALL_Msk                               /*!< desc TSALL */
#define CAN_MCR_TSONE_Pos                       (10U)
#define CAN_MCR_TSONE_Msk                       (0x1UL << CAN_MCR_TSONE_Pos)                    /*!< 0x00000400 */
#define CAN_MCR_TSONE                           CAN_MCR_TSONE_Msk                               /*!< desc TSONE */
#define CAN_MCR_TPA_Pos                         (11U)
#define CAN_MCR_TPA_Msk                         (0x1UL << CAN_MCR_TPA_Pos)                      /*!< 0x00000800 */
#define CAN_MCR_TPA                             CAN_MCR_TPA_Msk                                 /*!< desc TPA */
#define CAN_MCR_TPE_Pos                         (12U)
#define CAN_MCR_TPE_Msk                         (0x1UL << CAN_MCR_TPE_Pos)                      /*!< 0x00001000 */
#define CAN_MCR_TPE                             CAN_MCR_TPE_Msk                                 /*!< desc TPE */
#define CAN_MCR_STBY_Pos                        (13U)
#define CAN_MCR_STBY_Msk                        (0x1UL << CAN_MCR_STBY_Pos)                     /*!< 0x00002000 */
#define CAN_MCR_STBY                            CAN_MCR_STBY_Msk                                /*!< desc STBY */
#define CAN_MCR_LOM_Pos                         (14U)
#define CAN_MCR_LOM_Msk                         (0x1UL << CAN_MCR_LOM_Pos)                      /*!< 0x00004000 */
#define CAN_MCR_LOM                             CAN_MCR_LOM_Msk                                 /*!< desc LOM */
#define CAN_MCR_TBSEL_Pos                       (15U)
#define CAN_MCR_TBSEL_Msk                       (0x1UL << CAN_MCR_TBSEL_Pos)                    /*!< 0x00008000 */
#define CAN_MCR_TBSEL                           CAN_MCR_TBSEL_Msk                               /*!< desc TBSEL */
#define CAN_MCR_TSSTAT_Pos                      (16U)
#define CAN_MCR_TSSTAT_Msk                      (0x3UL << CAN_MCR_TSSTAT_Pos)                   /*!< 0x00030000 */
#define CAN_MCR_TSSTAT                          CAN_MCR_TSSTAT_Msk                              /*!< TSSTAT[17:16] bits (desc TSSTAT) */
#define CAN_MCR_TSSTAT_0                        (0x1UL << CAN_MCR_TSSTAT_Pos)                   /*!< 0x00010000 */
#define CAN_MCR_TSSTAT_1                        (0x2UL << CAN_MCR_TSSTAT_Pos)                   /*!< 0x00020000 */
#define CAN_MCR_TSFF_Pos                        (18U)
#define CAN_MCR_TSFF_Msk                        (0x1UL << CAN_MCR_TSFF_Pos)                     /*!< 0x00040000 */
#define CAN_MCR_TSFF                            CAN_MCR_TSFF_Msk                                /*!< desc TSFF */
#define CAN_MCR_TTTBM_Pos                       (20U)
#define CAN_MCR_TTTBM_Msk                       (0x1UL << CAN_MCR_TTTBM_Pos)                    /*!< 0x00100000 */
#define CAN_MCR_TTTBM                           CAN_MCR_TTTBM_Msk                               /*!< desc TTTBM */
#define CAN_MCR_TSMODE_Pos                      (21U)
#define CAN_MCR_TSMODE_Msk                      (0x1UL << CAN_MCR_TSMODE_Pos)                   /*!< 0x00200000 */
#define CAN_MCR_TSMODE                          CAN_MCR_TSMODE_Msk                              /*!< desc TSMODE */
#define CAN_MCR_TSNEXT_Pos                      (22U)
#define CAN_MCR_TSNEXT_Msk                      (0x1UL << CAN_MCR_TSNEXT_Pos)                   /*!< 0x00400000 */
#define CAN_MCR_TSNEXT                          CAN_MCR_TSNEXT_Msk                              /*!< desc TSNEXT */
#define CAN_MCR_RSTAT_Pos                       (24U)
#define CAN_MCR_RSTAT_Msk                       (0x3UL << CAN_MCR_RSTAT_Pos)                    /*!< 0x03000000 */
#define CAN_MCR_RSTAT                           CAN_MCR_RSTAT_Msk                               /*!< RSTAT[25:24] bits (desc RSTAT) */
#define CAN_MCR_RSTAT_0                         (0x1UL << CAN_MCR_RSTAT_Pos)                    /*!< 0x01000000 */
#define CAN_MCR_RSTAT_1                         (0x2UL << CAN_MCR_RSTAT_Pos)                    /*!< 0x02000000 */
#define CAN_MCR_RBALL_Pos                       (27U)
#define CAN_MCR_RBALL_Msk                       (0x1UL << CAN_MCR_RBALL_Pos)                    /*!< 0x08000000 */
#define CAN_MCR_RBALL                           CAN_MCR_RBALL_Msk                               /*!< desc RBALL */
#define CAN_MCR_RREL_Pos                        (28U)
#define CAN_MCR_RREL_Msk                        (0x1UL << CAN_MCR_RREL_Pos)                     /*!< 0x10000000 */
#define CAN_MCR_RREL                            CAN_MCR_RREL_Msk                                /*!< desc RREL */
#define CAN_MCR_ROV_Pos                         (29U)
#define CAN_MCR_ROV_Msk                         (0x1UL << CAN_MCR_ROV_Pos)                      /*!< 0x20000000 */
#define CAN_MCR_ROV                             CAN_MCR_ROV_Msk                                 /*!< desc ROV */
#define CAN_MCR_ROM_Pos                         (30U)
#define CAN_MCR_ROM_Msk                         (0x1UL << CAN_MCR_ROM_Pos)                      /*!< 0x40000000 */
#define CAN_MCR_ROM                             CAN_MCR_ROM_Msk                                 /*!< desc ROM */
#define CAN_MCR_SACK_Pos                        (31U)
#define CAN_MCR_SACK_Msk                        (0x1UL << CAN_MCR_SACK_Pos)                     /*!< 0x80000000 */
#define CAN_MCR_SACK                            CAN_MCR_SACK_Msk                                /*!< desc SACK */

