OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f072cx6.h
#define LCD_CR1_BLINKEN_Pos           (6U)
#define LCD_CR1_BLINKEN_Msk           (0x1UL << LCD_CR1_BLINKEN_Pos)            /*!< 0x00000040 */
#define LCD_CR1_BLINKEN               LCD_CR1_BLINKEN_Msk                       /*!< desc BLINKEN */

#define LCD_CR1_MODE_Pos              (8U)
#define LCD_CR1_MODE_Msk              (0x1UL << LCD_CR1_MODE_Pos)               /*!< 0x00000100 */
#define LCD_CR1_MODE                  LCD_CR1_MODE_Msk                          /*!< desc MODE */

#define LCD_CR1_IE_Pos                (9U)
#define LCD_CR1_IE_Msk                (0x1UL << LCD_CR1_IE_Pos)                 /*!< 0x00000200 */
#define LCD_CR1_IE                    LCD_CR1_IE_Msk                            /*!< desc IE */

#define LCD_CR1_DMAEN_Pos             (10U)
#define LCD_CR1_DMAEN_Msk             (0x1UL << LCD_CR1_DMAEN_Pos)              /*!< 0x00000400 */
#define LCD_CR1_DMAEN                 LCD_CR1_DMAEN_Msk                         /*!< desc DMAEN */

#define LCD_CR1_INTF_Pos              (11U)
#define LCD_CR1_INTF_Msk              (0x1UL << LCD_CR1_INTF_Pos)               /*!< 0x00000800 */
#define LCD_CR1_INTF                  LCD_CR1_INTF_Msk                          /*!< desc INTF */

/******************   Bit definition for LCD_INTCLR register   ****************/
#define LCD_INTCLR_INTF_CLR_Pos       (10U)
#define LCD_INTCLR_INTF_CLR_Msk       (0x1UL << LCD_INTCLR_INTF_CLR_Pos)        /*!< 0x00000001 */
#define LCD_INTCLR_INTF_CLR           LCD_INTCLR_INTF_CLR_Msk                   /*!< desc INTF_CLR */

/******************  Bits definition for LCD_POEN0 register  ******************/
#define LCD_POEN0_S0_Pos               (0U)
#define LCD_POEN0_S0_Msk               (0x1UL << LCD_POEN0_S0_Pos)              /*!< 0x00000001 */
#define LCD_POEN0_S0                   LCD_POEN0_S0_Msk
#define LCD_POEN0_S1_Pos               (1U)
#define LCD_POEN0_S1_Msk               (0x1UL << LCD_POEN0_S1_Pos)              /*!< 0x00000002 */
#define LCD_POEN0_S1                   LCD_POEN0_S1_Msk
#define LCD_POEN0_S2_Pos               (2U)
#define LCD_POEN0_S2_Msk               (0x1UL << LCD_POEN0_S2_Pos)              /*!< 0x00000004 */
#define LCD_POEN0_S2                   LCD_POEN0_S2_Msk
#define LCD_POEN0_S3_Pos               (3U)
#define LCD_POEN0_S3_Msk               (0x1UL << LCD_POEN0_S3_Pos)              /*!< 0x00000008 */
#define LCD_POEN0_S3                   LCD_POEN0_S3_Msk
#define LCD_POEN0_S4_Pos               (4U)
#define LCD_POEN0_S4_Msk               (0x1UL << LCD_POEN0_S4_Pos)              /*!< 0x00000010 */
#define LCD_POEN0_S4                   LCD_POEN0_S4_Msk
#define LCD_POEN0_S5_Pos               (5U)
#define LCD_POEN0_S5_Msk               (0x1UL << LCD_POEN0_S5_Pos)              /*!< 0x00000020 */
#define LCD_POEN0_S5                   LCD_POEN0_S5_Msk
#define LCD_POEN0_S6_Pos               (6U)
#define LCD_POEN0_S6_Msk               (0x1UL << LCD_POEN0_S6_Pos)              /*!< 0x00000040 */
#define LCD_POEN0_S6                   LCD_POEN0_S6_Msk
#define LCD_POEN0_S7_Pos               (7U)
#define LCD_POEN0_S7_Msk               (0x1UL << LCD_POEN0_S7_Pos)              /*!< 0x00000080 */
#define LCD_POEN0_S7                   LCD_POEN0_S7_Msk
#define LCD_POEN0_S8_Pos               (8U)
#define LCD_POEN0_S8_Msk               (0x1UL << LCD_POEN0_S8_Pos)              /*!< 0x00000100 */
#define LCD_POEN0_S8                   LCD_POEN0_S8_Msk
#define LCD_POEN0_S9_Pos               (9U)
#define LCD_POEN0_S9_Msk               (0x1UL << LCD_POEN0_S9_Pos)              /*!< 0x00000200 */
#define LCD_POEN0_S9                   LCD_POEN0_S9_Msk
#define LCD_POEN0_S10_Pos              (10U)
#define LCD_POEN0_S10_Msk              (0x1UL << LCD_POEN0_S10_Pos)             /*!< 0x00000400 */
#define LCD_POEN0_S10                  LCD_POEN0_S10_Msk
#define LCD_POEN0_S11_Pos              (11U)
#define LCD_POEN0_S11_Msk              (0x1UL << LCD_POEN0_S11_Pos)             /*!< 0x00000800 */
#define LCD_POEN0_S11                  LCD_POEN0_S11_Msk
#define LCD_POEN0_S12_Pos              (12U)
#define LCD_POEN0_S12_Msk              (0x1UL << LCD_POEN0_S12_Pos)             /*!< 0x00001000 */
#define LCD_POEN0_S12                  LCD_POEN0_S12_Msk
#define LCD_POEN0_S13_Pos              (13U)
#define LCD_POEN0_S13_Msk              (0x1UL << LCD_POEN0_S13_Pos)             /*!< 0x00002000 */
#define LCD_POEN0_S13                  LCD_POEN0_S13_Msk
#define LCD_POEN0_S14_Pos              (14U)
#define LCD_POEN0_S14_Msk              (0x1UL << LCD_POEN0_S14_Pos)             /*!< 0x00004000 */
#define LCD_POEN0_S14                  LCD_POEN0_S14_Msk
#define LCD_POEN0_S15_Pos              (15U)
#define LCD_POEN0_S15_Msk              (0x1UL << LCD_POEN0_S15_Pos)             /*!< 0x00008000 */
#define LCD_POEN0_S15                  LCD_POEN0_S15_Msk
#define LCD_POEN0_S16_Pos              (16U)
#define LCD_POEN0_S16_Msk              (0x1UL << LCD_POEN0_S16_Pos)             /*!< 0x00010000 */
#define LCD_POEN0_S16                  LCD_POEN0_S16_Msk
#define LCD_POEN0_S17_Pos              (17U)
#define LCD_POEN0_S17_Msk              (0x1UL << LCD_POEN0_S17_Pos)             /*!< 0x00020000 */
#define LCD_POEN0_S17                  LCD_POEN0_S17_Msk
#define LCD_POEN0_S18_Pos              (18U)
#define LCD_POEN0_S18_Msk              (0x1UL << LCD_POEN0_S18_Pos)             /*!< 0x00040000 */
#define LCD_POEN0_S18                  LCD_POEN0_S18_Msk
#define LCD_POEN0_S19_Pos              (19U)
#define LCD_POEN0_S19_Msk              (0x1UL << LCD_POEN0_S19_Pos)             /*!< 0x00080000 */
#define LCD_POEN0_S19                  LCD_POEN0_S19_Msk
#define LCD_POEN0_S20_Pos              (20U)
#define LCD_POEN0_S20_Msk              (0x1UL << LCD_POEN0_S20_Pos)             /*!< 0x00100000 */
#define LCD_POEN0_S20                  LCD_POEN0_S20_Msk
#define LCD_POEN0_S21_Pos              (21U)
#define LCD_POEN0_S21_Msk              (0x1UL << LCD_POEN0_S21_Pos)             /*!< 0x00200000 */
#define LCD_POEN0_S21                  LCD_POEN0_S21_Msk
#define LCD_POEN0_S22_Pos              (22U)
#define LCD_POEN0_S22_Msk              (0x1UL << LCD_POEN0_S22_Pos)             /*!< 0x00400000 */
#define LCD_POEN0_S22                  LCD_POEN0_S22_Msk
#define LCD_POEN0_S23_Pos              (23U)
#define LCD_POEN0_S23_Msk              (0x1UL << LCD_POEN0_S23_Pos)             /*!< 0x00800000 */
#define LCD_POEN0_S23                  LCD_POEN0_S23_Msk
#define LCD_POEN0_S24_Pos              (24U)
#define LCD_POEN0_S24_Msk              (0x1UL << LCD_POEN0_S24_Pos)             /*!< 0x01000000 */
#define LCD_POEN0_S24                  LCD_POEN0_S24_Msk
#define LCD_POEN0_S25_Pos              (25U)
#define LCD_POEN0_S25_Msk              (0x1UL << LCD_POEN0_S25_Pos)             /*!< 0x02000000 */
#define LCD_POEN0_S25                  LCD_POEN0_S25_Msk
#define LCD_POEN0_S26_Pos              (26U)
#define LCD_POEN0_S26_Msk              (0x1UL << LCD_POEN0_S26_Pos)             /*!< 0x04000000 */
#define LCD_POEN0_S26                  LCD_POEN0_S26_Msk
#define LCD_POEN0_S27_Pos              (27U)
#define LCD_POEN0_S27_Msk              (0x1UL << LCD_POEN0_S27_Pos)             /*!< 0x08000000 */
#define LCD_POEN0_S27                  LCD_POEN0_S27_Msk
#define LCD_POEN0_S28_Pos              (28U)
#define LCD_POEN0_S28_Msk              (0x1UL << LCD_POEN0_S28_Pos)             /*!< 0x10000000 */
#define LCD_POEN0_S28                  LCD_POEN0_S28_Msk
#define LCD_POEN0_S29_Pos              (29U)
#define LCD_POEN0_S29_Msk              (0x1UL << LCD_POEN0_S29_Pos)             /*!< 0x20000000 */
#define LCD_POEN0_S29                  LCD_POEN0_S29_Msk
#define LCD_POEN0_S30_Pos              (30U)
#define LCD_POEN0_S30_Msk              (0x1UL << LCD_POEN0_S30_Pos)             /*!< 0x40000000 */
#define LCD_POEN0_S30                  LCD_POEN0_S30_Msk
#define LCD_POEN0_S31_Pos              (31U)
#define LCD_POEN0_S31_Msk              (0x1UL << LCD_POEN0_S31_Pos)             /*!< 0x80000000 */
#define LCD_POEN0_S31                  LCD_POEN0_S31_Msk

/******************  Bits definition for LCD_POEN1 register  ******************/
#define LCD_POEN1_S32_Pos               (0U)
#define LCD_POEN1_S32_Msk               (0x1UL << LCD_POEN1_S32_Pos)              /*!< 0x00000001 */
#define LCD_POEN1_S32                   LCD_POEN1_S32_Msk
#define LCD_POEN1_S33_Pos               (1U)
#define LCD_POEN1_S33_Msk               (0x1UL << LCD_POEN1_S33_Pos)              /*!< 0x00000002 */
#define LCD_POEN1_S33                   LCD_POEN1_S33_Msk
#define LCD_POEN1_S34_Pos               (2U)
#define LCD_POEN1_S34_Msk               (0x1UL << LCD_POEN1_S34_Pos)              /*!< 0x00000004 */
#define LCD_POEN1_S34                   LCD_POEN1_S34_Msk
#define LCD_POEN1_S35_Pos               (3U)
#define LCD_POEN1_S35_Msk               (0x1UL << LCD_POEN1_S35_Pos)              /*!< 0x00000008 */
#define LCD_POEN1_S35                   LCD_POEN1_S35_Msk
#define LCD_POEN1_S36_Pos               (4U)
#define LCD_POEN1_S36_Msk               (0x1UL << LCD_POEN1_S36_Pos)              /*!< 0x00000010 */
#define LCD_POEN1_S36                   LCD_POEN1_S36_Msk
#define LCD_POEN1_S37_Pos               (5U)
#define LCD_POEN1_S37_Msk               (0x1UL << LCD_POEN1_S37_Pos)              /*!< 0x00000020 */
#define LCD_POEN1_S37                   LCD_POEN1_S37_Msk
#define LCD_POEN1_S38_Pos               (6U)
#define LCD_POEN1_S38_Msk               (0x1UL << LCD_POEN1_S38_Pos)              /*!< 0x00000040 */
#define LCD_POEN1_S38                   LCD_POEN1_S38_Msk
#define LCD_POEN1_S39_Pos               (7U)
#define LCD_POEN1_S39_Msk               (0x1UL << LCD_POEN1_S39_Pos)              /*!< 0x00000080 */
#define LCD_POEN1_S39                   LCD_POEN1_S39_Msk

#define LCD_POEN1_C0_Pos                (8U)
#define LCD_POEN1_C0_Msk                (0x1UL << LCD_POEN1_C0_Pos)               /*!< 0x00000100 */
#define LCD_POEN1_C0                    LCD_POEN1_C0_Msk                          /*!< desc C0 */
#define LCD_POEN1_C1_Pos                (9U)
#define LCD_POEN1_C1_Msk                (0x1UL << LCD_POEN1_C1_Pos)               /*!< 0x00000200 */
#define LCD_POEN1_C1                    LCD_POEN1_C1_Msk                          /*!< desc C1 */
#define LCD_POEN1_C2_Pos                (10U)
#define LCD_POEN1_C2_Msk                (0x1UL << LCD_POEN1_C2_Pos)               /*!< 0x00000400 */
#define LCD_POEN1_C2                    LCD_POEN1_C2_Msk                          /*!< desc C2 */
#define LCD_POEN1_C3_Pos                (11U)
#define LCD_POEN1_C3_Msk                (0x1UL << LCD_POEN1_C3_Pos)               /*!< 0x00000800 */
#define LCD_POEN1_C3                    LCD_POEN1_C3_Msk                          /*!< desc C3 */

#define LCD_POEN1_MUX_Pos               (12U)
#define LCD_POEN1_MUX_Msk               (0x1UL << LCD_POEN1_MUX_Pos)              /*!< 0x00001000 */
#define LCD_POEN1_MUX                   LCD_POEN1_MUX_Msk                         /*!< desc MUX */

